In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1 . Find out how many male and female passenger was onboarded .
2. how many survived we have .
3. how many casuality we have 
4 . what is name of a person who is the eldest one . 
5 . how many passenger do we have in first , second and third class 
6. how many person we have whose name starts with "s"
7. try to create a new column which is a summation  of "SibSp" and "parch"
8 . how many person do we have below age of 25 .
9 . how many person died whose age was less then 40 
10 . from a  cabin column seperate text and numeric value .

In [4]:
#1 . Find out how many male and female passenger was onboarded .

In [5]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [6]:
df.groupby('Sex')['Sex'].count()[1:2]       # type is series , so you can do slicing operation

Sex
male    577
Name: Sex, dtype: int64

In [7]:
male_count=df.loc[df['Sex'] == 'male' ]

In [8]:
len(male_count)

577

In [9]:
female_count=df.loc[ df['Sex'] == 'female' ].index

In [10]:
female_count

Int64Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
            ...
            866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
           dtype='int64', length=314)

In [11]:
#without LOC
len(df[df['Sex'] == 'female' ].index)

314

In [12]:
len(female_count)

314

In [13]:
#both male & female count together

In [14]:
male_or_female_count=df.loc[ (df['Sex'] == 'male') | (df['Sex'] == 'female')].index

In [15]:
len(male_or_female_count)

891

In [16]:
len(df[ (df['Sex'] == 'male') | (df['Sex'] == 'female')].index)  # w/o loc

891

In [17]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [18]:
# 2. how many survived we have .

In [19]:
df['Survived'].value_counts()[1:]

1    342
Name: Survived, dtype: int64

In [20]:
survived=df[df['Survived']== 1].index

In [21]:
len(survived)

342

In [22]:
df[df['Survived']== 1].shape[0]

342

In [23]:
#3. how many casuality we have

In [24]:
casuality=df[df['Survived']== 0]

In [25]:
len(casuality)

549

In [26]:
#4 . what is name of a person who is the eldest one .

In [27]:
df[df['Age'] == df['Age'].max()]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [28]:
df[df['Age'] == df['Age'].max()][['Name','Age']]

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [29]:
df[df['Age'] ==  max(df['Age'])]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [30]:
#5 . how many passenger do we have in first , second and third class

In [31]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [32]:
df.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

In [33]:
len(df[df['Pclass']==1].index)   #1st class passenger

216

In [34]:
len(df[df['Pclass']==2])  #2nd class passenger

184

In [35]:
len(df[df['Pclass']==3])  #3rd class passenger

491

In [36]:
#6. how many person we have whose name starts with "s"

In [37]:
len(df[df['Name'].str.startswith('S')])

86

In [38]:
#7. try to create a new column which is a summation  of "SibSp" and "parch"

In [39]:
df['summation']= df['SibSp'] + df['Parch']

In [40]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,summation
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [41]:
#8 . how many person do we have below age of 25 .

In [42]:
len(df[df['Age'] < 25])

278

In [43]:
#9 . how many person died whose age was less then 40

In [44]:
 len(df[ (df['Age'] < 40) & (df['Survived'] == 0) ])

322

In [45]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,summation
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [46]:
#10 . from a  cabin column seperate text and numeric value .

In [47]:
import re    #regular expression

In [48]:
replace_var = re.compile("([a-zA-Z]+)")

In [49]:
df['string_cabin'] = df['Cabin'].str.extract(replace_var)
df['number_cabin'] = df['Cabin'].str.replace(replace,"")

NameError: name 'replace' is not defined

In [ ]:
df

In [ ]:
df['first_column'] = df['Cabin'].str.slice(stop=1)

In [ ]:
df['sec_column'] = df['Cabin'].str.slice(start=1)

In [ ]:
df

In [ ]:
df['Cabin'].str.slice(stop=1)

In [ ]:
df['Cabin'].str.slice(start=1)

In [ ]:
###################################################################################################################
###################################################################################################################
###################################################################################################################

In [ ]:
#dataset link - https://archive.ics.uci.edu/ml/datasets/Bank+Marketing

df1=pd.read_csv('bank.csv',sep=";")

1 . how many campaign available in this dataset . 
2 . how many users do we have with housing and personal loan . 
3. how many person do we have whose age is 60+ . 
4 . in which month we have trageted most of the customer . 
5 . which mode of call is giving you more result  
6 . how many enterpeures do we have in this list  
7 . how many customers do we have with negative balance 
8. prepare a group of data based on education level .  


https://codeshare.io/X8PY8Y

In [ ]:
df1.head()

In [ ]:
#1 . how many campaign available in this dataset .

In [ ]:
len(df1['campaign'].unique())     #unique campaign available

In [ ]:
len(set(list(df1['campaign'])))

In [ ]:
len(df1[df1['campaign'].notnull()].index)    # available campaign taking one row as one campaign

In [ ]:
df1.sum()['campaign']      ###  sum of all  columns and then fetch campaign sum

In [ ]:
sum1 = df1[df1['campaign'].notnull()].sum('rows')['campaign']     # available campaign ...by summing of all campaign ?????????   CHECK  ?????

In [ ]:
sum1

In [ ]:
2 . how many users do we have with housing and personal loan .

In [ ]:
len(df1[ (df1['housing'] == 'yes') & (df1['loan'] == 'yes')].index)

In [ ]:
len(df1[df1['housing'] == 'yes'].index)

In [ ]:
len(df1[df1['loan'] == 'yes'].index)

In [ ]:
#3. how many person do we have whose age is 60+ .

In [ ]:
 len(df1[df1['age'] > 60] .index)

In [ ]:
df1

In [ ]:
df1.month.unique()

In [ ]:
#4 . in which month we have trageted most of the customer .

In [ ]:
df1['month'].value_counts()

In [ ]:
df1['month'].value_counts().index[0]

In [ ]:
df1.groupby(df1.month)['poutcome'].count()   #may

In [ ]:
#5 . which mode of call is giving you more result

In [ ]:
df_group = df1.groupby(['contact','y']).count()

In [ ]:
df_group

In [ ]:
df_group.loc['cellular','yes'][0]

In [ ]:
df_group.loc['telephone','yes'][0]

In [ ]:
df_group.loc['unknown','yes'][0]

In [ ]:
max(df_group.loc['cellular','yes'][0],df_group.loc['telephone','yes'][0],df_group.loc['unknown','yes'][0])

In [ ]:
#6 . how many enterpeures do we have in this list

In [ ]:
len(df1[df1['job'] == 'entrepreneur'])

In [ ]:
#7 . how many customers do we have with negative balance

In [ ]:
len(df1[df1['balance'] < 0 ].index)

In [ ]:
#8. prepare a group of data based on education level .

In [ ]:
l=[]
for i in df1['education'].unique():
    l.append(df1[df1['education'] == i ])

In [ ]:
l[0]